accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/offers/GetContractOffers-Response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/ServiceManagement/GetContractOffers">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetContractOffersResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--Optional:-->
               <get:ContractId>?</get:ContractId>
               <!--Optional:-->
               <get:ContractIdPub>?</get:ContractIdPub>
               <!--Optional:-->
               <get:ListOfOffers>
                  <!--Zero or more repetitions:-->
                  <get:Offer>
                     <!--Optional:-->
                     <get:PackageId>?</get:PackageId>
                     <!--Optional:-->
                     <get:PackageIdPub>?</get:PackageIdPub>
                     <!--Optional:-->
                     <get:PackageName>?</get:PackageName>
                     <!--Optional:-->
                     <get:PackageStatus>?</get:PackageStatus>
                     <!--Optional:-->
                     <get:StatusDate>?</get:StatusDate>
                     <!--Optional:-->
                     <get:ChargeCommitment>?</get:ChargeCommitment>
                  </get:Offer>
               </get:ListOfOffers>
            </lcew:Body>
         </Response>
      </web:GetContractOffersResponse>
   </soapenv:Body>
</soapenv:Envelope>